xl182/os_stm32f429/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f429xx.h"
#include "stdio.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void SystemClock_Config(void);
extern void MX_FREERTOS_Init(void);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define T_RST_Pin GPIO_PIN_8
#define T_RST_GPIO_Port GPIOI
#define TEMP_BUS_Pin GPIO_PIN_1
#define TEMP_BUS_GPIO_Port GPIOC
#define LCD_SPI_BL_Pin GPIO_PIN_2
#define LCD_SPI_BL_GPIO_Port GPIOH
#define LED_Pin GPIO_PIN_0
#define LED_GPIO_Port GPIOB
#define T_SCK_Pin GPIO_PIN_6
#define T_SCK_GPIO_Port GPIOH
#define T_INT_Pin GPIO_PIN_7
#define T_INT_GPIO_Port GPIOH
#define LCD_SPI_CS_Pin GPIO_PIN_12
#define LCD_SPI_CS_GPIO_Port GPIOB
#define LCD_SPI_SCK_Pin GPIO_PIN_13
#define LCD_SPI_SCK_GPIO_Port GPIOB
#define LCD_SPI_SDA_Pin GPIO_PIN_15
#define LCD_SPI_SDA_GPIO_Port GPIOB
#define WS_DI_Pin GPIO_PIN_8
#define WS_DI_GPIO_Port GPIOA
#define T_SDA_Pin GPIO_PIN_3
#define T_SDA_GPIO_Port GPIOI
#define LCD_SPI_DC_Pin GPIO_PIN_14
#define LCD_SPI_DC_GPIO_Port GPIOG
#define LCD_BL_Pin GPIO_PIN_5
#define LCD_BL_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#define SCREEN_WIDTH 1024
#define SCREEN_HEIGHT 600
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
